# Prepare data

In [81]:
import pandas as pd
import numpy

In [85]:
sheets = ['Jan', 'Feb', 'March', 'Apr', 'May', 'Jun', 'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec']
file_path = '/Users/danaalnusair/Downloads/Bank Statement Analysis.xlsx'
all_sheets = pd.read_excel(file_path, sheet_name=None)

excluded_sheet = 'Dropdowns'
all_sheets.pop(excluded_sheet, None)  # Remove the unwanted sheet

combined_data = pd.concat(all_sheets.values(), ignore_index=True)

In [86]:
# combined_data

In [87]:
debited_df = combined_data[(combined_data['Transaction Type'] == 'Debit') & (combined_data['Category'] != 'Savings')]
credited_df = combined_data[(combined_data['Transaction Type'] == 'Credit')]

# Travel Expenses

In [88]:
travel_debited_df = debited_df[debited_df['Location'] != 'Jordan']
travel_credited_df = credited_df[credited_df['Location'] != 'Jordan']

In [89]:
grouped_debited = travel_debited_df.groupby('Location').sum().abs()
grouped_debited

          (—) Debit (+) Credit
Location
Germany                 36.359
Turkey                2847.626
UK                    2784.840

In [90]:
grouped_credited = travel_credited_df.groupby('Location').sum().abs()
# Match the grouped_credited with grouped_debited and fill in the NaN values with zeros.
grouped_credited = grouped_credited.reindex(grouped_debited.index, fill_value=0)
grouped_credited

          (—) Debit (+) Credit
Location
Germany                   0.00
Turkey                    0.00
UK                       60.68

#### All travel spending (taking refunds into account)

In [91]:
grouped_debited - grouped_credited

          (—) Debit (+) Credit
Location
Germany                 36.359
Turkey                2847.626
UK                    2724.160

# Jordan Expenses

In [92]:
jordan_data = debited_df[debited_df['Location'] == 'Jordan']
jordan_data.groupby('Category').sum().abs()

                    (—) Debit (+) Credit
Category
Account Commission                17.500
Beauty                            26.900
Bill                             268.481
Cash (ATM)                       380.000
CliQ                             591.000
Electronics                      132.500
Gas                               87.600
Gift                             188.000
Grocery                           35.660
Home                              11.500
Restaurant                        79.332
Zain Cash                        350.200